// ------------------------------------------------------------------
// ゲーム世界のオブジェクトを外部設定で初期化する
// ------------------------------------------------------------------

const world = new WorldContext({
  title: 'EngageWithTales -Eroded Muse-',
  url: 'resources/town.json',
  settings: {
    textSpeed: 16,
    squareSize: new Size(32, 32),
    distance: 2,
    keyCodes: {
      'left': 65,
      'right': 68,
      'bottom': 83,
      'top': 87,
      'open': 74,
      'close': 75
    }
  }
});

// ------------------------------------------------------------------
// ゲーム世界の開始
// ------------------------------------------------------------------

world.start();
